<?php
session_start();

// Проверка дали е предаден идентификатор на продукта в URL адреса
if (isset($_GET['id'])) {
    // Извличане на идентификатора на продукта от URL адреса
    $product_id = $_GET['id'];

    // Добавяне на продукта към количката (примерно може да използвате сесии за съхранение на данни за количката)
    $_SESSION['cart'][] = $product_id;

    // Пренасочване към страницата на количката
    header("Location: cart.php");
    exit();
} else {
    // Ако не е предаден идентификатор на продукта, връщаме се обратно към страницата с продукта или правим нещо друго според вашите изисквания
    header("Location: index.php");
    exit();
}
?>
